{
"alfred-workflow":"This SmartApp allows you to interact with the things in your physical graph through Alfred.",
"beacon-control":"Execute a Hello, Home phrase, turn on or off some lights, and/or lock or unlock your door when you enter or leave a monitored region",
"big-turn-off":"Turn your lights off when the SmartApp is tapped or activated",
"big-turn-on":"Turn your lights on when the SmartApp is tapped or activated.",
"bon-voyage":"Monitors a set of SmartSense Presence tags or smartphones and triggers a mode change when everyone has left.  Used in conjunction with Big Turn Off or Make It So to turn off lights, appliances, adjust the thermostat, turn on security apps, and more.",
"bose-soundtouch-control":"Control your Bose® SoundTouch® when certain actions take place in your home.",
"brighten-dark-places":"Turn your lights on when a open/close sensor opens and the space is dark.",
"brighten-my-path":"Turn your lights on when motion is detected.",
"button-controller":"Control devices with buttons like the Aeon Labs Minimote",
"camera-power-scheduler":"Turn the power on and off at a specific time. ",
"cameras-on-when-im-away":"Turn cameras on when I'm away",
"carpool-notifier":"Send notifications to your carpooling buddies when you arrive to pick them up. If the person you are picking up is home, and has been for 5 minutes or more, they will get a notification when you arrive.",
"close-the-valve":"Close a selected valve if moisture is detected, and get notified by SMS and push notification.",
"color-coordinator":"Ties multiple colored lights to one specific light's settings",
"curling-iron":"Turns on an outlet when the user is present and off after a period of time",
"darken-behind-me":"Turn your lights off after a period of no motion being observed.",
"device-tile-controller":"A controller SmartApp to install virtual devices into your location in order to simulate various native Device Tiles.",
"double-tap":"Turn on or off any number of switches when an existing switch is tapped twice in a row.",
"dry-the-wetspot":"Turns switch on and off based on moisture sensor input.",
"elder-care-daily-routine":"Stay connected to your loved ones. Get notified if they are not up and moving around by a specified time and/or if they have not opened a cabinet or door according to a set schedule.",
"elder-care-slip-fall":"Monitors motion sensors in bedroom and bathroom during the night and detects if occupant does not return from the bathroom after a specified period of time.",
"energy-alerts":"Get notified if you're using too much energy",
"energy-saver":"Turn things off if you're using too much energy",
"every-element":"Every element demonstration app",
"feed-my-pet":"Setup a schedule for when your pet is fed. Purchase any SmartThings certified pet food feeder and install the Feed My Pet app, and set the time. You and your pet are ready to go. Your life just got smarter.",
"flood-alert":"Get a push notification or text message when water is detected where it doesn't belong.",
"forgiving-security":"Alerts you if something happens while you're away.  Has a settable grace period to compensate for presence sensors that may take a few seconds to be noticed.",
"garage-door-monitor":"Monitor your garage door and get a text message if it is open too long",
"garage-door-opener":"Open your garage door when a switch is turned on.",
"gentle-wake-up":"Dim your lights up slowly, allowing you to wake up more naturally.",
"gideon-smart-home":"Gideon Smart Home SmartApp allows you to connect and control all of your SmartThings devices through the Gideon app, making your SmartThings devices even smarter.",
"gidjit-hub":"Act as an endpoint so user's of Gidjit can quickly access and control their devices and execute routines. Users can do this quickly as Gidjit filters these actions  based on their environment",
"good-night":"Changes mode when motion ceases after a specific time of night.",
"greetings-earthling":"Monitors a set of presence detectors and triggers a mode change when someone arrives at home.",
"habit-helper":"Add something you want to be reminded about each day and get a text message to help you form positive habits.",
"has-barkley-been-fed":"Setup a schedule to be reminded to feed your pet. Purchase any SmartThings certified pet food feeder and install the Feed My Pet app, and set the time. You and your pet are ready to go. Your life just got smarter.",
"hello-home-phrase-director":"Monitor a set of presence sensors and activate Hello, Home phrases based on whether your home is empty or occupied.  Each presence status change will check against the current 'sun state' to run phrases based on occupancy and whether the sun is up or down.",
"hub-ip-notifier":"Listen for local IP changes when your hub registers.",
"hue-mood-lighting":"Sets the colors and brightness level of your Philips Hue lights to match your mood.",
"humidity-alert":"Notify me when the humidity rises above or falls below the given threshold. It will turn on a switch when it rises above the first threshold and off when it falls below the second threshold.",
"it-moved":"Send a text when movement is detected",
"its-too-cold":"Monitor the temperature and when it drops below your setting get a text and/or turn on a heater or additional appliance.",
"its-too-hot":"Monitor the temperature and when it rises above your setting get a notification and/or turn on an A/C unit or fan.",
"jawbone-button-notifier":"Send push notifications or text messages with your Jawbone Up when you hold the button.",
"jenkins-notifier":"Turn off and on devices based on the state that your Jenkins Build is in.",
"keep-me-cozy":"Changes your thermostat settings automatically in response to a mode change.  Often used with Bon Voyage, Rise and Shine, and other Mode Magic SmartApps to automatically keep you comfortable while you're present and save you energy and money while you are away.",
"keep-me-cozy-ii":"Works the same as Keep Me Cozy, but enables you to pick an alternative temperature sensor in a separate space from the thermostat. Focuses on making you comfortable where you are spending your time rather than where the thermostat is located.",
"laundry-monitor":"Sends a message and (optionally) turns on or blinks a light to indicate that laundry is done.",
"left-it-open":"Notifies you when you have left a door or window open longer that a specified amount of time.",
"let-there-be-dark":"Turn your lights off when a Contact Sensor is opened and turn them back on when it is closed, ONLY if the Lights were previouly on",
"let-there-be-light":"Turn your lights on when a SmartSense Multi is opened and turn them off when it is closed.",
"life360-connect":"Life360 Service Manager",
"light-follows-me":"Turn your lights on when motion is detected and then off again once the motion stops for a set period of time.",
"lighting-director":"Control up to 4 sets (scenarios) of lights based on motion, door contacts and illuminance levels.",
"lights-off-when-closed":"Turn your lights off when an open/close sensor closes.",
"light-up-the-night":"Turn your lights on when it gets dark and off when it becomes light again.",
"lock-it-at-a-specific-time":"Make sure a door is locked at a specific time.  Option to add door contact sensor to only lock if closed.",
"lock-it-when-i-leave":"Locks a deadbolt or lever lock when a SmartSense Presence tag or smartphone leaves a location.",
"mail-arrived":"Send a text when mail arrives in your mailbox using a SmartSense Multi on your mailbox door. Note: battery life may be impacted in cold climates.",
"make-it-so":"Saves the states of a specified set switches and thermostat setpoints and restores them at each mode change. To use 1) Set the mode, 2) Change switches and setpoint to where you want them for that mode, and 3) Install or update the app. Changing to that mode or touching the app will set the devices to the saved state.",
"medicine-management-contact-sensor":"This supports devices with capabilities of ContactSensor and ColorControl (LED). It sends an in-app and ambient light notification if you forget to open the drawer or cabinet where meds are stored. A reminder will be set to a single time per day. If the draw or cabinet isn't opened within 60 minutes of that reminder, an in-app message will be sent. If the draw or cabinet still isn't opened after an additional 10 minutes, then an LED light turns red until the draw or cabinet is opened",
"medicine-reminder":"Set up a reminder so that if you forget to take your medicine (determined by whether a cabinet or drawer has been opened) by specified time you get a notification or text message.",
"mini-hue-controller":"Control one or more Hue bulbs using an Aeon MiniMote.",
"mood-cube":"Set your lighting by rotating a cube containing a SmartSense Multi",
"nfc-tag-toggle":"Allows toggling of a switch, lock, or garage door based on an NFC Tag touch event",
"notify-me-when":"Receive notifications when anything happens in your home.",
"notify-me-when-it-opens":"Get a push message sent to your phone when an open/close sensor is opened.",
"notify-me-with-hue":"Changes the color and brightness of Philips Hue bulbs when any of a variety of SmartThings is activated.  Supports motion, contact, acceleration, moisture and presence sensors as well as switches.",
"once-a-day":"Turn on one or more switches at a specified time and turn them off at a later time.",
"opent2t-smartapp-test":"Test app to test end to end SmartThings scenarios via OpenT2T",
"photo-burst-when":"Take a burst of photos and send a push notification when...",
"power-allowance":"Save energy or restrict total time an appliance (like a curling iron or TV) can be in use.  When a switch turns on, automatically turn it back off after a set number of minutes you specify.",
"presence-change-push":"Get a push notification when a SmartSense Presence tag or smartphone arrives at or departs from a location.",
"presence-change-text":"Send me a text message when my presence status changes.",
"ready-for-rain":"Warn if doors or windows are open when inclement weather is approaching.",
"ridiculously-automated-garage-door":"Monitors arrival and departure of car(s) and 1) opens door when car arrives, 2) closes door after car has departed (for N minutes), 3) opens door when car door motion is detected, 4) closes door when door was opened due to arrival and interior door is closed.",
"rise-and-shine":"Changes mode when someone wakes up after a set time in the morning.",
"scheduled-mode-change":"Changes mode at a specific time of day.",
"severe-weather-alert":"Get a push notification when severe weather is in your area.",
"shabbat-and-holiday-modes":"Changes the mode at candle lighting and back after havdalah.  Uses the HebCal.com API to look for days that are shabbat or chag and pull real time candle lighting and havdalah times to change modes automatically",
"simple-sync-trigger":"Trigger Simple Control activities when certain actions take place in your home.",
"single-button-controller":"Use your Aeon Panic Button to setup events when the button is used",
"sleepy-time":"Use Jawbone sleep mode events to automatically execute Hello, Home phrases. Automatially put the house to bed or wake it up in the morning by pushing the button on your UP.",
"smart-alarm":"A multi-zone virtual alarm panel, featuring customizable security zones. Setting of an alarm can activate sirens, turn on light switches, push notification and text message. Alarm is armed and disarmed simply by setting SmartThings location 'mode'.",
"smartblock-chat-sender":"Send chat messages into Minecraft via the SmartBlock mod",
"smart-care-daily-routine":"Stay connected to your loved ones. Get notified if they are not up and moving around by a specified time and/or if they have not opened a cabinet or door according to a set schedule.",
"smart-care-detect-motion":"Monitors motion sensors in bedroom and bathroom during the night and detects if occupant does not return from the bathroom after a specified period of time.",
"smart-home-ventilation":"Allows for setting up various schedule scenarios for turning on and off home ventilation switches.",
"smart-humidifier":"Turn on/off humidifier based on relative humidity from a sensor.",
"smart-nightlight":"Turns on lights when it's dark and motion is detected. Turns lights off when it becomes light or some time after motion ceases.",
"smart-security":"Alerts you when there are intruders but not when you just got up for a glass of water in the middle of the night",
"smart-turn-it-on":"Turns on selected device(s) at a set time on selected days of the week only if a selected person is present and turns off selected device(s) after a set time.",
"smartweather-station-controller":"Updates SmartWeather Station Tile devices every hour.",
"sonos-music-modes":"Plays a different selected song or station for each mode.",
"sonos-remote-control":"Control your Sonos system with an Aeon Minimote",
"speaker-control":"Play or pause your Speaker when certain actions take place in your home.",
"speaker-mood-music":"Plays a selected song or station.",
"speaker-notify-with-sound":"Play a sound or custom message through your Speaker when the mode changes or other events occur.",
"speaker-weather-forecast":"Play a weather report through your Speaker when the mode changes or other events occur",
"sprayer-controller-2":"Control Sprayers for a period of time a number of times per hour",
"spruce-scheduler":"Setup schedules for Spruce irrigation controller",
"step-notifier":"Use a step tracker device to track daily step goals and trigger various device actions when your goals are met!",
"sunrise-sunset":"Changes mode and controls lights based on local sunrise and sunset times.",
"switch-activates-home-phrase-or-mode":"Ties a Hello, Home phrase or mode to a switch's state. Perfect for use with IFTTT.",
"switch-changes-mode":"Ties a mode to a switch's state. Perfect for use with IFTTT.",
"talking-alarm-clock":"Control up to 4 waking schedules using a Sonos speaker as an alarm.",
"text-me-when-it-opens":"Get a text message sent to your phone when an open/close sensor is opened.",
"text-me-when-theres-motion-and-im-not-here":"Send a text message when there is motion while you are away.",
"the-big-switch":"Turns on, off and dim a collection of lights based on the state of a specific switch.",
"the-flasher":"Flashes a set of lights in response to motion, an open/close event, or a switch.",
"the-gun-case-moved":"Send a text when your gun case moves",
"thermostat-auto-off":"Automatically turn off thermostat when windows/doors open. Turn it back on when everything is closed up.",
"thermostats":"Receive notifications when anything happens in your home.",
"turn-it-on-for-5-minutes":"When a SmartSense Multi is opened, a switch will be turned on, and then turned off after 5 minutes.",
"turn-it-on-when-im-here":"Turn something on when you arrive and back off when you leave.",
"turn-it-on-when-it-opens":"Turn something on when an open/close sensor opens.",
"turn-on-only-if-i-arrive-after-sunset":"Turn something on only if you arrive after sunset and back off anytime you leave.",
"ubi":"Add your Ubi device to your SmartThings Account",
"undead-early-warning":"Undead Early Warning",
"unlock-it-when-i-arrive":"Unlocks the door when you arrive at your location.",
"virtual-device-creator":"Creates virtual devices",
"virtual-thermostat":"Control a space heater or window air conditioner in conjunction with any temperature sensor, like a SmartSense Multi.",
"weatherbug-home":"WeatherBug Home",
"weather-underground-pws-connect":"Connect your SmartSense Temp/Humidity sensor to your Weather Underground Personal Weather Station.",
"when-its-going-to-rain":"Is your shed closed? Are your windows shut? Is the grill covered? Are your dogs indoors? Will the lawn and plants need to be watered tomorrow?",
"whole-house-fan":"Toggle a whole house fan (switch) when: Outside is cooler than inside, Inside is above x temp, Thermostat is off",
"withings-manager":"Connect With Withings",
"working-from-home":"If after a particular time of day a certain person is still at home, trigger a 'Working From Home' action.",
"yoics-connect":"Connect and Control your Yoics Enabled Devices",
"smart-humidity-vent":"When the humidity reaches a specified level, activate one or more fans.",
"smart-home-monitor":"monitor your home for intrusion, fire, carbon_monoxide, leaks and more."
}